[
    {
        "user": "AELDDK2E3MWFFRD7MW6PMOB65FRA",
        "seed_product_type": "Trail Running",
        "situation": "Looking for new trail running shoes for weekend hikes and runs.",
        "budget_range": "around $80–$110",
        "query_type": "categorical",
        "user_query": "want comfortable trail running shoes for women",
        "user_context": {
            "brand_preferences": "The user shows clear loyalty to performance-focused running brands, especially New Balance: multiple purchases and comments like \"I own a lot of New Balance\" and \"never disappointed\" indicate strong repeat preference and trust in that brand's fit and consistency. They also buy broadly across specialty running brands (Topo Athletic, Brooks, Salomon, ASICS, Reebok, Fila), indicating openness to trying other reputable makers when the product matches trail-running needs. When a brand consistently delivers expected fit, comfort and durability (New Balance, Topo Athletic), the user returns to it; when sizing or fit is off (as with one New Balance/other pair that ran small) they note it but still remain generally brand-loyal to those that perform reliably.",
            "price_sensitivity": "The user's behavior indicates medium price sensitivity: they are willing to pay mid-range prices for shoes that deliver fit, comfort and technical features (one purchase at $89.99 was described as \"so worth the money\"), but they mostly buy from mainstream, value-oriented performance brands rather than premium luxury lines. They prioritize value for money — paying more when the shoe offers clear benefits (durability, traction, cushioning) but do not seek out the cheapest possible options or bargain-only purchases.",
            "rating_sensitivity": "The user demonstrates moderate review sensitivity: they pay attention to product descriptions, ratings and the reputation of established brands, but their own purchase and rating patterns show they rely heavily on personal fit and past brand experience. They will buy items with average ratings in the 3.5–4.5 range if the features and brand history match their needs, and they leave positive reviews when satisfied. Ratings inform decisions but do not override fit, comfort or known brand consistency.",
            "functional_requirements": "For trail running shoes the user consistently requires reliable traction and outsole durability (multidirectional lugs, Vibram or similar compounds), protective features (rock plate or toe protection, protective overlays), secure heel and midfoot fit (split-mesh or heel security), adequate cushioning balanced with ground feel (low to moderate drop, cushioning that still allows natural motion), and weather/terrain resistance (mud/snow release design, water-repellent coatings or drainage). They also expect breathability, a comfortable collar/padding, and a fit that does not cause toe crowding or difficulty putting the shoe on.",
            "aesthetic_preferences": "The user prefers practical, sporty designs with visible functional details rather than fashion-only sneakers. They appreciate attractive, noticeable colors (comments like \"love the color\" and \"color is outstanding\"), often choosing shoes with color accents (purple, bold tones) while still favoring classic trail silhouettes. Overall they favor utilitarian styling that also offers some personality through color rather than minimalist or purely fashion-forward looks.",
            "purchase_preferences": "The user values fast, reliable shipping and accurate product descriptions (they praised \"shipping was quite fast\" and that shoes matched descriptions). They prefer trustworthy sellers and established brand listings (Amazon/brand stores) and expect consistent sizing information — they will return items when sizing is wrong but may tolerate minor fit issues if the shoe is useful. Clear return policies, easy exchanges for correct sizes, and sellers that deliver on advertised features are important to their shopping satisfaction."
        },
        "check_list": {
            "brand_preferences": [
                "Brand is New Balance",
                "Brand is one of: Topo Athletic, Brooks, Salomon, ASICS, Reebok, Fila"
            ],
            "price_sensitivity": [
                "Listed price falls within $80–$110",
                "If listed price exceeds $110, product specification explicitly includes high-value technical features such as Vibram outsole, proven long-wear compound, or documented enhanced durability"
            ],
            "rating_sensitivity": [
                "Displayed average customer rating is between 3.5 and 4.5",
                "Customer reviews include multiple verified-purchase comments referencing fit, comfort, or traction"
            ],
            "functional_requirements": [
                "Outsole description specifies multidirectional lugs or a named durable traction compound (e.g., Vibram)",
                "Product specification lists toe protection or a rock plate or reinforced protective overlay",
                "Product listing documents heel and midfoot security features (e.g., molded heel counter, split-mesh, or lockdown lacing)",
                "Midsole specification indicates low-to-moderate drop and cushioning described to balance ground feel and protection",
                "Materials or description state breathability and a padded collar without indications of toe crowding (e.g., toe-box width described or size guidance)"
            ],
            "aesthetic_preferences": [
                "Shoe uses a classic trail silhouette with visible functional details (overlays, lugs, protective toe)",
                "At least one available colorway includes a noticeable color accent or bold tone rather than exclusively muted/neutrals"
            ],
            "purchase_preferences": [
                "Seller is an established retailer or brand-authorized store (e.g., official brand store or major marketplace seller) in the listing",
                "Shipping estimate indicates fast delivery or specified expedited options",
                "Product page includes clear sizing guidance and/or a size chart consistent with brand sizing notes",
                "Return or exchange policy is clearly stated and allows size exchanges or returns without excessive restrictions"
            ]
        }
    },
    {
        "user": "AEODBPA3DIR3J5BLOQQUCB2KZYQQ",
        "seed_product_type": "Mules & Clogs",
        "situation": "Looking for comfortable, supportive slippers for indoor wear.",
        "budget_range": "around $40–50",
        "query_type": "categorical",
        "user_query": "need comfy women's clogs",
        "user_context": {
            "brand_preferences": "This shopper shows strong loyalty to Easy Spirit: 10 of 11 reviewed purchases are Easy Spirit shoes, and she repeatedly buys new colors and patterns from that brand. Her reviews praise Easy Spirit’s consistent fit, removable insoles and comfort features, and she actively seeks new variations in the same model line. She is not brand-loyal across categories — a single Baggallini accessory was rated lower (3/5) for being heavy and slippery — which suggests she will switch brands for accessories but prefers Easy Spirit for footwear.",
            "price_sensitivity": "Medium sensitivity. Most purchases fall in the $35–$55 range and she repeatedly pays those mid-range prices for comfort and specific features rather than hunting for the cheapest option. She does not appear to avoid full-price items and is willing to pay roughly $40–55 for shoes that meet her comfort and design standards, indicating she balances cost against perceived value.",
            "rating_sensitivity": "Medium sensitivity. She does not rigidly follow average star ratings — several of her purchases had mixed average ratings (3.6–4.6) yet she still bought and gave high personal ratings — but she pays attention to product details and previous personal experience with the brand. Her decisions lean more on hands-on factors (fit, removable insoles, comfort) and trust in a familiar model than on star ratings alone.",
            "functional_requirements": "Essential requirements center on foot comfort and support: removable cushioned insole compatible with orthotics, reliable arch support, lightweight construction, and a durable rubber or EVA outsole for traction. She favors slip-on mule/clog silhouettes with breathable uppers (mesh, leather or fabric) and a stable heel height around 1–1.5 inches. She also values a snug-but-conforming fit (breaks in after wear) and would appreciate a closed-back option or added heel retention for safer backward movement.",
            "aesthetic_preferences": "She favors feminine, playful and eye-catching designs: floral prints, tropical foliage, iridescent sequins, and celestial motifs in bronze-gold or shimmering tones. Color preferences include blues (deep purplish-black/blue, sparkling blue) and metallic accents; she specifically seeks unique patterns and seasonal variations and likes when multiple shoe types share matching colors/patterns. Overall she prefers shoes that are both decorative and visibly distinctive — pieces that attract compliments and stand out.",
            "purchase_preferences": "She prioritizes consistent product availability from the same brand line and clear, accurate product images and descriptions (she notes photos can underrepresent the item). She values consistent sizing and dependable fit information so repeat purchases work well, and she favors sellers/brands that maintain a wide variety of patterns and restocks. While she has not commented on shipping speed or returns often, her behavior implies she prefers reliable, authoritative listings (brand storefronts) with straightforward information so she can confidently buy multiple pairs."
        },
        "check_list": {
            "brand_preferences": [
                "Product is from Easy Spirit or explicitly listed as the same Easy Spirit model line as previous releases",
                "Same model is offered in at least two additional colorways or patterns by the brand",
                "Sold through the brand's official storefront or an authorized Easy Spirit retailer as stated on the listing"
            ],
            "price_sensitivity": [
                "Listed price falls within the user's stated budget range of $40–$50",
                "If listed price exceeds $40–50, it does not exceed $55 (the user's wider acceptable price ceiling per purchase history)"
            ],
            "rating_sensitivity": [
                "Product listing contains written customer reviews that specifically mention fit, removable insole, or comfort",
                "At least one review references prior purchases of the same model line or repeated purchases from the brand"
            ],
            "functional_requirements": [
                "Manufacturer or product details explicitly state a removable cushioned insole with compatibility for orthotics",
                "Product specifications document arch support or a supportive midsole design",
                "Heel height is documented as approximately 1 to 1.5 inches",
                "Outsole material is specified as rubber or EVA for traction and durability",
                "Silhouette is listed as slip-on mule/clog or the listing offers a closed-back variant or heel retention feature"
            ],
            "aesthetic_preferences": [
                "Product images or description show feminine, decorative patterns such as floral, tropical foliage, iridescent/sequin, or celestial motifs",
                "Available colorways include deep/bluish tones or metallic/bronzish-sparkling accents as shown in photos",
                "The model is offered in visually distinctive patterns that are promoted as seasonal or limited variations"
            ],
            "purchase_preferences": [
                "Listing includes multiple, high-quality product images that accurately represent colors and patterns (multiple angles and close-ups)",
                "Size chart and fit guidance are provided and consistent with the brand's historical sizing information on the storefront",
                "Listing indicates ongoing availability or restock frequency for the same model line and multiple patterns"
            ]
        }
    },
    {
        "user": "AGJNR6VGW35EPGBETUQ4VYJUOGGA",
        "seed_product_type": "Watch Bands",
        "situation": "Wants a comfortable and stylish replacement watch strap for everyday wear.",
        "budget_range": "around $10–$20",
        "query_type": "categorical",
        "user_query": "checking out new watch bands",
        "user_context": {
            "brand_preferences": "The user shows recurring purchases from value-focused accessory brands rather than luxury houses. They repeatedly buy iStrap leather bands (multiple orders) and several Infantry and BARTON nylon/ballistic straps, indicating loyalty to cost-effective, watch-focused brands that offer many color and size options. They also try smaller niche makers (Clockwork Synergy, MetaStrap, deBeer, 2PiS) when the product matches form and function. Overall the user prefers specialist strap brands that provide consistent fit options and fast availability rather than a single premium brand identity.",
            "price_sensitivity": "The user is price-aware but not extremely price-averse: most purchases fall in the low-to-mid price range (~$8–$15), and they explicitly cite a good price–quality ratio as a reason to buy multiples. They buy several inexpensive replacements for multiple watches and accept lower-cost construction when value and color selection are strong, so their sensitivity is medium — they balance cost against durability and appearance and will buy multiple budget items when value is clear.",
            "rating_sensitivity": "The user considers ratings and product details but does not rigidly follow star thresholds. They have purchased items with average ratings ranging from the high 3s to nearly 5.0 and left positive reviews for lower-rated items when the fit, color, or function met expectations. This indicates a medium dependence on reviews: ratings matter as one data point, but personal fit, price and product photos/descriptions are equally important in decision-making.",
            "functional_requirements": "For watch straps the user consistently requires correct lug-width compatibility (common widths: 18mm, 20mm, 22mm), easy interchangeability (quick swap or slip-thru/NATO style), comfortable materials for long wear (soft nylon or leather, breathable for summer), secure hardware (sturdy buckles or reliable deployment clasps that do not irritate skin), and reasonable water/sweat resistance for active use. They also value included installation tools or simple installation instructions and expect sufficient length options to fit typical wrist sizes.",
            "aesthetic_preferences": "The user favors sporty-but-clean designs and vibrant or sharp colors for casual straps and classic, matte leather looks for dressier options. Recurring preferences include NATO/ZULU sporty styles, bright or contrasting stripes, matte (not glossy) leather finishes, visible stitching over glued edges, and modest hardware (stainless steel or yellow-gold plated hardware depending on the strap). They prefer straps cut to a length that doesn’t leave an obvious tail and dislike excessive or bulky hardware.",
            "purchase_preferences": "The user values fast shipping (noting when items 'ship faster than others'), trustworthy sellers with responsive customer service, and clear product packaging (appreciates branded boxes). They prefer listings that include installation tools and clear sizing/length guidance, and they like free or Prime shipping. Easy returns and seller responsiveness are important implicitly (they choose vendors advertising support and ‘purchase without worry’). Durability information and care instructions (e.g., wiping metal parts) influence their seller choice as well."
        },
        "check_list": {
            "brand_preferences": [
                "Brand is one of these specialist strap makers or clearly positioned as a value-focused strap brand: iStrap, Infantry, BARTON, Clockwork Synergy, MetaStrap, deBeer, 2PiS, or described as a strap-focused manufacturer with multiple model lines",
                "Product listing shows the brand offers multiple color and size options for the same strap model (>=2 colors and >=2 lug-widths)",
                "Brand or seller documentation includes consistent fit/spec guidance (size chart or stated lug-width compatibilities) matching standard watch widths"
            ],
            "price_sensitivity": [
                "Product price is within the user's budget range of $10–$20",
                "Product listing explicitly states materials and construction details (e.g., nylon weave type, leather finish, buckle material) that justify the price",
                "Multiple-unit value or repeat-buy rationale is evident (e.g., low per-unit price, multipack option, or frequent sales/discounts noted)"
            ],
            "rating_sensitivity": [
                "Average product rating falls in the user's historically accepted range (≈3.5–5.0 stars) as displayed on the listing",
                "At least one user review includes photos or clear comments confirming color accuracy and fit for the stated lug-width",
                "Multiple user reviews specifically mention strap durability or hardware performance (buckles/clasps) in real-world use"
            ],
            "functional_requirements": [
                "Strap is offered in correct lug-widths for the user (explicitly lists 18mm, 20mm, or 22mm as applicable)",
                "Strap design supports easy interchangeability (listed as quick-release, slip-thru/NATO/ZULU, or provides quick-swap hardware)",
                "Material specification indicates comfort and breathability for long wear (e.g., described as soft nylon, breathable weave, or soft leather) and mentions water/sweat resistance",
                "Hardware specification lists secure materials and type (stainless steel or plated buckle/clamper, deployment clasp) and describes finish without bulky construction",
                "Listing includes length options or stated total strap length and tail clearance suitable for typical wrists (length measurements provided)"
            ],
            "aesthetic_preferences": [
                "Product photos and description show a sporty-but-clean design (NATO/ZULU or slim sport strap profile) rather than bulky or heavily ornate styling",
                "Color options include vibrant or sharp shades and/or contrasting stripes as shown in product imagery",
                "Leather options are described or depicted as matte finish (non-gloss) with visible stitched edges rather than glued glossy edges",
                "Hardware finish options include modest stainless steel or yellow-gold plated hardware consistent with the strap color, and hardware is low-profile in photos"
            ],
            "purchase_preferences": [
                "Listing offers fast shipping options (explicitly lists expedited shipping, Prime, or estimated delivery that is shorter than typical marketplace averages)",
                "Seller listing includes clear sizing/installation guidance or provides installation tools in the package",
                "Product packaging or listing photos indicate clear/branded packaging (box or labeled pouch) or seller description mentions branded packaging",
                "Seller page or listing states return policy and shows responsive customer service indicators (seller ratings, recent answers to questions, or ‘purchase with confidence’ messaging)"
            ]
        }
    },
    {
        "user": "AGZMKHWSCB3UXDGFUPFRZSL4EAWQ",
        "seed_product_type": "Tanks & Camis",
        "situation": "Looking for a comfortable and stylish tank top for warm weather and casual outings.",
        "budget_range": "around $20–$40",
        "query_type": "categorical",
        "user_query": "need a nice sleeveless tank top for summer",
        "user_context": {
            "brand_preferences": "The user is brand-agnostic and shows no strong loyalty to any single label. Their purchases span many small, direct-to-consumer or niche Amazon fashion brands (FOROLAV, Uincloset, IRISGOD, Gemijack, Ms Lovely, Woolly, etc.), indicating they choose brands by item fit and features rather than by name recognition. They regularly buy inexpensive basics but will select a specialty or performance brand when the product offers clear functional benefits (for example, paying more for Woolly merino for moisture-wicking and odor control).",
            "price_sensitivity": "Medium sensitivity. Most purchases fall into the low-cost basic apparel range (many items at or under $20; examples include $9.99 and $18.98), demonstrating attention to value and affordability. However, the user is willing to pay a higher price (around $50–$60) for garments with demonstrable performance or technical benefits, so price matters but is secondary to perceived quality and function.",
            "rating_sensitivity": "Medium sensitivity. The user buys items with a range of average ratings (from ~3.4 up to 4.6) and consistently leaves high reviews themselves, which suggests they consider ratings as one factor among fit, material, and description rather than using star ratings as a strict gate. They do not restrict purchases only to 4+ star items, but ratings influence decisions alongside product details.",
            "functional_requirements": "For tops and tanks the user consistently needs comfortable, breathable fabrics (cotton blends, viscose/rayon blends, or merino) with some stretch and good drape. Key functional needs are true-to-size or slightly roomy fits that provide coverage and modesty (not see-through), contouring to hide problem areas (midsection), and suitability for both casual wear and light workouts (moisture wicking or athletic cut when intended for exercise). Easy care instructions (machine wash or simple hand wash) and durable construction are also important.",
            "aesthetic_preferences": "The user prefers simple, versatile styles and solid colors—bright and vivid tones (red, deep purple, blue) and neutrals like white and gray—over overly fussy patterns. Favored silhouettes include racerback, scoop neck, crew neck, and relaxed or slightly fitted tanks; occasional feminine details (lace trim, scallops, peplum) and light, playful graphics are acceptable but only as accents. Overall the aesthetic is casual, wearable, and flattering rather than trendy or ornate.",
            "purchase_preferences": "The user values accurate sizing information and clear product descriptions (size guides and realistic photos) from sellers. They prefer listings that state fabric content and care instructions and appreciate responsive seller/customer support when sizing or fit questions arise. They are comfortable buying from third-party Amazon sellers provided there is transparent information about fit, easy-to-follow care, and reasonable assurances about returns or seller assistance if the item does not fit as expected."
        },
        "check_list": {
            "brand_preferences": [
                "Brand is not a recognized luxury label and can be a small direct-to-consumer or niche Amazon brand (examples: FOROLAV, Uincloset, IRISGOD, Gemijack, Ms Lovely, Woolly-style vendors).",
                "Product listing explicitly states functional/technical benefits when price is higher (e.g., merino for moisture-wicking or odor control) to justify paying above typical basic prices."
            ],
            "price_sensitivity": [
                "Listed price falls within the user's stated budget of $20–$40.",
                "If listed price exceeds $40 (up to ~$60), the product documentation includes explicit, verifiable performance or technical claims (e.g., merino, moisture-wicking, odor control) to justify the premium."
            ],
            "rating_sensitivity": [
                "Product average star rating is at least 3.4 stars.",
                "User-generated reviews include multiple verified-comments addressing fit, fabric hand/opacity, or care (mentions of size accuracy, see-through risk, or washing durability)."
            ],
            "functional_requirements": [
                "Fabric content explicitly lists breathable fibers (cotton, viscose/rayon, or merino) and/or a stretch fiber (e.g., elastane) in the product description.",
                "Fit description or size chart indicates true-to-size or slightly roomy fit (size chart measurements present with wearable dimensions or model sizing notes).",
                "Material description or reviews confirm the fabric is not see-through under normal lighting (explicit opacity claim or reviewer notes about coverage).",
                "If marketed for exercise or light workouts, product description lists moisture-wicking or athletic cut features."
            ],
            "aesthetic_preferences": [
                "Listing offers solid-color options in bright/vivid tones (e.g., red, deep purple, blue) and/or neutrals (white, gray).",
                "Available silhouettes include at least one of these: racerback, scoop neck, crew neck, or a relaxed/slightly fitted tank.",
                "Product imagery shows a simple, versatile style with no more than small feminine accents (e.g., subtle lace trim, scallop edge, or small graphic) rather than large ornate patterns."
            ],
            "purchase_preferences": [
                "Product page includes clear fabric content and care instructions (e.g., machine wash or simple hand wash explicitly stated).",
                "Listing provides a detailed size guide (measurements or model sizing + size worn) and realistic photos showing fit on a body.",
                "Seller information indicates an accessible return policy or seller responsiveness (return window or contact method clearly listed).",
                "Customer Q&A or seller response history demonstrates timely answers to sizing/fit questions (visible replies to buyer questions)."
            ]
        }
    },
    {
        "user": "AFSHW2WFOQPCRNV4SNDH4NQKN6IQ",
        "seed_product_type": "Jeans",
        "situation": "Looking for comfortable capri jeans suitable for warm weather and casual outings.",
        "budget_range": "around $30–$50",
        "query_type": "categorical",
        "user_query": "need to find women's capri jeans",
        "user_context": {
            "brand_preferences": "The user shows clear brand familiarity and selective loyalty within mid-market denim and casual wear. They repeatedly purchase and praise Jag Jeans (multiple 5-star reviews) and Signature by Levi Strauss & Co. (several purchases and positive comments), and they have also bought Gloria Vanderbilt and KUT from the Kloth. They switch between Levi’s sub‑brands based on fit and price (e.g., preferring Levi Signature over some Levi lines) but show strong repeat preference for Jag and Signature when the fit and stretch meet their expectations. Overall they favor established denim labels with consistent sizing and quality rather than unknown or fast‑fashion brands.",
            "price_sensitivity": "The user demonstrates medium price sensitivity: they are value‑conscious and actively compare prices, but will pay more when the product delivers perceived quality. Examples include celebrating purchases at $21.99 and $28.99 as “jackpot” finds, calling out when a comparable Levi Signature pair at nearly half the price beat a more expensive option, and still buying Jag items priced higher when fit and fabric justify it. They seek bargains but are willing to spend more for proper fit, real denim feel, and durability.",
            "rating_sensitivity": "The user displays medium review sensitivity: they read and reference other customers’ comments (e.g., seam issues mentioned by others) and use ratings as one factor, but they rely heavily on their own fit tests and personal experience. High personal ratings (mostly 4–5 stars) indicate they will buy well‑rated items, yet they still try mid‑rated items if descriptions and features match their needs. They also trust seller policies and service reports in purchase decisions (mentions of Amazon customer service and free returns influenced continued buying).",
            "functional_requirements": "For jeans and similar bottoms the user requires a straight or slightly relaxed leg (not skinny or flared), a mid‑ to just‑below‑waist rise to minimize muffin top, enough real‑denim cotton content with a small amount of stretch (examples seen: ~98% cotton/2% spandex or blends with 1–2% elastane) and strong recovery so the garment keeps shape. They expect true denim appearance (not overly elastic “fake” jeans), comfortable waistband (no digging), options for pull‑on or zip‑fly depending on fit, and machine‑washable fabrics that hold up to cold wash/hang dry. Inseam/length consistency (around 31",
            "aesthetic_preferences": "The user prefers classic, understated denim styling: straight or modern straight cuts, neutral and versatile washes (indigo, gray, classic blue, lighter seasonal weights), minimal embellishment, and authentic denim texture rather than shiny or overly stretchy looks. They avoid skinny ankles and flares, favor a length that works with flats and low heels, and like subtle pocket details (small signature embroidery) rather than flashy hardware or heavy distressing. Color choices skew neutral and wearable across seasons.",
            "purchase_preferences": "The user values reliable sizing information, generous return policies, and responsive customer service: they returned defective items and praised free replacements and free shipping. Accurate size listings and consistent fit across purchases are important; inconsistent sizing (e.g., same brand varying by 3 sizes) is a purchase deterrent. They prefer sellers with easy returns, clear product details (fabric content, rise, inseam), and quick resolution from customer service. Delivery speed and special packaging were not emphasized; functional, trustworthy order fulfillment and post‑sale support are the priority."
        },
        "check_list": {
            "brand_preferences": [
                "Product is from Jag Jeans, Signature by Levi Strauss & Co., Gloria Vanderbilt, or KUT from the Kloth"
            ],
            "price_sensitivity": [
                "Listed price is within $30–$50",
                "If listed price exceeds $50, product documentation or fabric details indicate higher-quality real-denim construction that could justify paying more",
                "If product is on sale, sale price is at or below $28.99 (comparable to previously noted \"jackpot\" finds)"
            ],
            "rating_sensitivity": [
                "Displayed average customer rating is 4.0 stars or higher",
                "Product has multiple customer reviews that specifically mention fit consistency, seam durability, or fabric recovery (searchable keywords: fit, seams, recovery, stretch)",
                "Seller review/comments reference reliable return or replacement experiences (mentions of free returns/replacements or responsive service)"
            ],
            "functional_requirements": [
                "Cut description lists straight or slightly relaxed leg (explicitly excludes skinny or flared)",
                "Rise is specified as mid or just-below-waist in product description",
                "Fabric content lists predominantly cotton with low-stretch elastane/spandex (examples in context: ~98% cotton with ~1–2% elastane/spandex)",
                "Garment description or care label states machine-washable and care instructions consistent with cold wash/hang dry",
                "Waistband described as non-digging/comfort waistband or product reviews confirm comfortable waistband and good shape recovery"
            ],
            "aesthetic_preferences": [
                "Color/wash options include neutral, versatile washes (indigo, classic blue, gray, or light seasonal washes)",
                "Design lists minimal embellishment with subtle pocket details rather than heavy hardware or heavy distressing",
                "Length described as capri that pairs with flats and low heels (product images or measurements show hem falling at mid-calf to just-above-ankle)",
                "Fabric appearance described as authentic denim texture (not shiny or overly elastic-looking)"
            ],
            "purchase_preferences": [
                "Product page provides accurate, item-level size chart with measurements for waist, rise, and inseam",
                "Seller offers a clear return policy with free or low-cost returns and/or free replacements noted",
                "Product listing includes explicit fabric content, rise, and inseam measurements in the description",
                "Seller has documented history or reviews indicating responsive customer service and consistent sizing across multiple listings"
            ]
        }
    }
]