[
    {
        "user": "AH7KKC5MZSTA5JLCOIH6D6OXFXRQ",
        "seed_product_type": "Hard Candy",
        "situation": "Looking for nostalgic, flavorful fruit candies to enjoy and share with family.",
        "budget_range": "around $10–$20 for multi-pack candy assortments",
        "query_type": "attribute_specific",
        "user_query": "want citadel black child-safe dinosaur cupcake decorations with double-sided prints",
        "user_context": {
            "brand_preferences": "The user shows an affinity for nostalgic and novelty candy brands rather than strict loyalty to a single manufacturer. They repeatedly purchase Pop Rocks/Pop Rocks assortments and other classic U.S. candy names (Pop Rocks, Life Savers, Chase’s), indicating a strong preference for legacy or retro candy experiences. At the same time they are willing to try international or niche brands (Mitmai, Taiki, AJOS, JUWA), especially for unique fruit or regional flavors. Their repurchase behavior (multiple 5-star reviews and statements like “Will definitely order again”) indicates they re-order specific products they like, but they do not consistently stick to one brand across all purchases — brand choice is driven more by product type, flavor profile, and nostalgic value than brand name alone.",
            "price_sensitivity": "Overall the user appears to have medium price sensitivity. They buy both lower-cost items (roughly $9–$12 bags) and higher-priced variety or bulk packs ($19–$25 range) without obvious reluctance, suggesting they will pay more when they perceive value (bulk quantity, assortment, novelty or gift packaging). They favor multi-packs and bulk sizes (e.g., 18-pack Pop Rocks, 2 lb bags, 3-pack sets), implying sensitivity to cost-per-unit and desire for value rather than always choosing the cheapest single-item option. There is no evidence they exclusively chase bargains or discount-only offers.",
            "rating_sensitivity": "The user demonstrates moderate review sensitivity. They sometimes purchase items that have middling average ratings (e.g., ~3.6–3.9) and still rate them highly when they personally like them, so ratings are considered but not determinative. Personal taste and nostalgia and family feedback (grandson comments) often override average scores; however, a low personal satisfaction combined with inability to return (noted complaint) does negatively affect their view. In short, they use ratings as one factor among several, but rely heavily on personal and family taste cues.",
            "functional_requirements": "For candy purchases the user consistently requires authentic, enjoyable flavor and the expected texture/experience (hard vs. soft, popping sensation, chocolate, sour intensity). They prefer assortments and variety packs so consumers can try multiple flavors in one purchase. Packaging should clearly state unit counts/weights and number of pieces. Individually wrapped pieces or single-serve packets are important for portion control and sharing with children. Allergy and ingredient labeling (gluten/nut-free statements) and clear country-of-origin or manufacturer information are also useful selection criteria.",
            "aesthetic_preferences": "The user favors colorful, playful, and nostalgic visual styles: retro or classic candy branding, bright multi-color packaging, variety assortments with visually distinct flavors, and decorative gift-ready boxes or licensed stickers. They prefer products that emphasize fun experiences (popping candy, novelty textures) and cute or themed patterns on candies. Small, individually packaged portions with visible flavor cues and cheerful designs are preferred over plain or utilitarian packaging.",
            "purchase_preferences": "The user values an accurate product description, reliable seller service, and a straightforward return policy. They expect products to arrive as described and to be fresh; inability to return an unsatisfactory product was explicitly noted as a negative. They favor sellers who offer bulk/multipack options, clear shipping timelines, and gift-friendly presentation (decorative boxes). Quick response to questions and timely shipping matter, especially for purchases intended for family (grandson) or events. Secure, intact packaging is important to ensure freshness and presentation on arrival."
        },
        "check_list": {
            "brand_preferences": [
                "Product listing includes at least one legacy or retro U.S. candy brand name (e.g., Pop Rocks, Life Savers, Chase’s) or explicitly marketed as a classic/nostalgic candy experience",
                "Product assortment contains international or niche brand options (brand names such as Mitmai, Taiki, AJOS, JUWA) when offering unique regional or fruit flavors",
                "Product description documents specific product type and flavor profiles so brand selection is driven by flavor/nostalgia rather than brand-only marketing"
            ],
            "price_sensitivity": [
                "Total price for the multi-pack falls within $10–$20",
                "Price-per-unit (price divided by number of individual pieces or servings) is comparable to previously purchased multi-packs in the $9–$25 range (calculate and compare)",
                "Listing offers multi-pack or bulk packaging options (e.g., 2+ packs, variety packs, or counted assortments) rather than only single small units"
            ],
            "rating_sensitivity": [
                "Product displays an average customer rating and at least 10 customer reviews to provide a representative sample for evaluation",
                "Detailed reviews include flavor and family feedback (mentions of children/grandson or family reactions) to weigh personal taste cues over average score",
                "Review content documents freshness or return experiences (mentions of inability to return or freshness complaints) to inform risk assessment"
            ],
            "functional_requirements": [
                "Packaging documents total weight and/or explicit unit count (number of pieces or servings) in the product description",
                "Product specifies candy texture/experience (e.g., popping sensation, hard/soft, sour intensity, chocolate) for each flavor in the assortment",
                "Individual pieces are individually wrapped or sold in single-serve packets as stated in the product details",
                "Ingredient list and allergy information (gluten/nut-free status) and country-of-origin or manufacturer name are present in the product description"
            ],
            "aesthetic_preferences": [
                "Product images and description show colorful, retro or nostalgic-style packaging with bright multi-color design or classic candy branding",
                "Assortment includes visually distinct flavors with images or labels that indicate each flavor color/appearance",
                "Product offers gift-friendly or decorative presentation options (decorative box, themed stickers, or visually attractive multi-pack) in the listing"
            ],
            "purchase_preferences": [
                "Product description accurately lists contents, flavors, unit counts, weight, and packaging condition in the listing",
                "Seller provides stated shipping timeline and shipping method in the listing or checkout information",
                "Return policy or refund/exchange process is documented on the product page or seller profile",
                "Seller has documented responsiveness indicators (seller feedback score or stated customer service contact/response time) and the listing notes packaging protections to ensure freshness on arrival"
            ]
        }
    },
    {
        "user": "AH4AYCHAWIHLLT76SACC6J6CGZ4A",
        "seed_product_type": "Soft Drinks",
        "situation": "Curious to try a unique seasonal soda flavor for an autumn gathering.",
        "budget_range": "under $5",
        "query_type": "attribute_specific",
        "user_query": "want Garvy's bottled soft drink with pumpkin pie flavor",
        "user_context": {
            "brand_preferences": "The user favors specialty and legacy beverage brands that emphasize traditional recipes and authentic flavor. They repeatedly try novelty lines from Lester's Fixins (multiple Lester's products reviewed) but often treat them as one-off curiosities rather than long-term loyalty purchases. They show clear positive affinity for heritage or craft labels that deliver consistent quality—examples include Frostie (very positive review), Sidral Mundet, Cock'n Bull, Kickapoo Joy Juice, and the Belgian St. Bernardus Abt 12. Conversely, the user expresses distrust and reluctance to support large conglomerates that alter recipes for cost savings (explicit criticism of AB InBev/Interbrew and its effect on Leffe), indicating brand loyalty is tied to perceived integrity and production methods rather than marketing alone.",
            "price_sensitivity": "The user displays medium price sensitivity: they will pay premium prices for products perceived as high quality or authentic (willing to purchase high-ABV Belgian ales and larger multi-bottle packs), but they are alert to suspiciously low prices and will penalize items that seem cheaper due to cost-cutting. They note concrete price comparisons (e.g., Leffe bottles at about $4–$6, a 24-pack Frostie at $58.18) and are comfortable buying both single specialty bottles and bulk packs when value aligns with quality. They balance cost with provenance and ingredient quality (preferring cane sugar over high-fructose corn syrup), so price matters but is subordinate to authenticity and taste.",
            "rating_sensitivity": "The user demonstrates moderate sensitivity to ratings and reviews: they read and reference external information and average ratings but rely heavily on personal tasting and direct experience. They will try low- or mixed-rated novelty items out of curiosity (several novel sodas sampled despite low averages) but expect strong positive consensus for premium purchases. Ratings are one factor among provenance, ingredient quality, and flavor authenticity rather than the sole decision driver.",
            "functional_requirements": "For beverages the user prioritizes authentic, clearly expressed flavor profiles (e.g., pronounced ginger and hint of lime for ginger beer, true coffee or fruit notes for flavored sodas), real sweeteners (preference for cane sugar over HFCS), appropriate carbonation and mouthfeel (full body or slight bite as appropriate), and no unpleasant lingering or chemical aftertastes. For beers they expect full-bodied complexity, layered flavors that open with temperature, a velvety mouthfeel, and an ABV aligned with style (example: 10% ABV Belgian abbey ale noted positively). Packaging that preserves product character (glass bottles, corked 750 ml for sharing) is also functionally important.",
            "aesthetic_preferences": "The user prefers nostalgic and distinctive packaging: glass bottles, vintage or comic-derived label art (Kickapoo), corked 750 ml bottles for Belgian ales, and bold, colorful presentations (purple grape, blood-red sodas, skull-and-crossbones motifs). They appreciate branding that signals tradition, craft, or regional origin rather than generic mass-market design. Novelty visual cues are welcome when they match an intriguing or authentic flavor experience.",
            "purchase_preferences": "The user values reliable availability and clear provenance: they shop specialty retailers (local shops like Jim's Apple Farm) and expect consistent stocking for favorite items. For online purchases they favor sellers that note freshness and fast shipping ('ships fresh and fast') and they buy both single bottles and bulk packs depending on occasion. Transparent manufacturer information, honest ingredient/ownership disclosure, and careful glass packaging are important. They are sensitive to distribution/availability changes and negative corporate behavior that may affect long-term purchasing; return policy or customer service is secondary but they prefer straightforward transactions and sellers who preserve product integrity."
        },
        "check_list": {
            "brand_preferences": [
                "Brand listed as a heritage, craft, or specialty beverage label (examples in user profile: Frostie, Sidral Mundet, Cock'n Bull, Kickapoo Joy Juice, St. Bernardus, or Lester's Fixins).",
                "Brand ownership statement discloses independent or craft ownership rather than ownership by a large conglomerate (product page or label mentions parent company; absence of conglomerate ownership is indicated).",
                "Product is marketed as preserving a traditional recipe or artisanal production method (product description explicitly states traditional recipe, small-batch, craft, regional origin, or similar provenance language)."
            ],
            "price_sensitivity": [
                "Single-bottle unit price listed at $5.00 or less.",
                "Per-bottle price for any available multi-pack option does not exceed $5.00 per bottle."
            ],
            "rating_sensitivity": [
                "Average consumer rating on the product page or retailer site is 3.0 stars or higher when purchasing for curiosity; average rating is 4.0 stars or higher when relying on reviews as primary purchase justification.",
                "At least one recent review (within past 2 years, if date available) mentions authentic flavor or ingredient fidelity (e.g., references to true spice, real fruit, or cane sugar) rather than only novelty or packaging."
            ],
            "functional_requirements": [
                "Ingredient list names cane sugar (or other natural sugar) rather than high-fructose corn syrup.",
                "Product description specifies the seasonal/unique flavor with clear flavor notes (e.g., cinnamon, apple, pumpkin spice, ginger, etc.) and indicates a pronounced flavor profile rather than vague wording.",
                "Packaging preserves product character: product is sold in a glass bottle (glass indicated in product specifications or images).",
                "Product description or reviews report appropriate carbonation or mouthfeel for the style (phrasing such as \"full-bodied carbonation,\" \"crisp bite,\" or reviewer comments about carbonation level)."
            ],
            "aesthetic_preferences": [
                "Product is presented in glass packaging as shown in product images or specifications.",
                "Label art is distinctive or nostalgic (vintage, comic-derived, bold/colorful, or otherwise non-generic design visible in images).",
                "Package format allows single-bottle purchase (product sold as individual glass bottles rather than only large, sealed multi-packs)."
            ],
            "purchase_preferences": [
                "Seller or product page provides clear manufacturer information and ingredient provenance (manufacturer name and ingredient sourcing information visible).",
                "For online offers, shipping information explicitly states fast shipping or freshness handling (phrases such as \"ships fresh and fast,\" expedited shipping options, or chilled/fresh handling noted).",
                "Product availability is indicated as in-stock at specialty retailers or niche sellers (stock level or retailer listing shows consistent availability rather than \"limited\" or \"out of stock\" status)."
            ]
        }
    },
    {
        "user": "AHJQPUQLSQZE6LMIUMY7WNRXCQQQ",
        "seed_product_type": "Herbal",
        "situation": "Looking for a soothing herbal tea to support lung health and respiratory comfort.",
        "budget_range": "around $10–$15",
        "query_type": "attribute_specific",
        "user_query": "want caffeine-free herbal tea with mullein leaf and flower in convenient tea bags",
        "user_context": {
            "brand_preferences": "The shopper shows clear affinity for established herbal-tea brands and for products labeled organic and transparently sourced. She explicitly calls Yogi her favorite brand and buys it in multi-box quantities, and she has repeatedly purchased Wickedly Prime (an Amazon brand) and other specialty brands like Wild Bliss, Kehl-Kronenhof and My Land. Her loyalty is driven less by a single marque than by consistent product attributes (organic, full‑leaf or visible plant parts, health claims), so she will try different brands that meet those expectations but returns to brands that deliver those qualities reliably.",
            "price_sensitivity": "Medium sensitivity: she compares value and will pay more for organic, specialty, or bulk offerings but notices and praises good prices. Her purchase history ranges from value loose‑leaf options (~$8) to premium wellness blends (~$30) and multi‑box packs (Yogi), indicating she balances cost with quality and certification rather than seeking the cheapest option exclusively.",
            "rating_sensitivity": "Medium sensitivity: she considers product quality and ingredient claims alongside her own taste tests and outcomes. Reviews and product details (organic, non‑GMO, country or farm of origin) matter to her, but she frequently evaluates items by brewing them and adjusting steep time or concentration; she does not rely solely on star ratings and will repurchase based on personal experience.",
            "functional_requirements": "For herbal teas and similar wellness drinks she consistently needs caffeine‑free or low‑caffeine formulations, clear ingredient lists (no fillers, non‑GMO, organic when possible), convenient formats (tea bags or sachets that preserve full‑leaf quality), and palpable potency—brews that deliver noticeable flavor or effect. She values reusable or protective packaging, clear steeping instructions and sufficient unit counts (25–64 bags or similarly sized loose‑leaf quantities) so the product can be used repeatedly and taken on the go.",
            "aesthetic_preferences": "She prefers natural, clean, and premium rustic packaging: tins, clear pouches, and fine sachet/triangle bags that show full‑leaf pieces or flower parts. She likes individually wrapped bags with no staples, visible branding or origin labeling, and presentation that looks giftable or boutique rather than mass‑grocery. Subtle, earthy colors and simple, informative labels appeal to her more than flashy designs.",
            "purchase_preferences": "She values freshness-preserving packaging (individually sealed pouches, airtight tins), accurate product descriptions (origin, certifications, brewing instructions), and sellers that offer straightforward satisfaction guarantees or easy replacements. She buys in multi‑packs for convenience, prefers formats she can carry to restaurants, and expects shipment that avoids damage to tins or packaging; she is comfortable buying from reputable brands and marketplaces that provide reliable delivery and clear return/replacement policies."
        },
        "check_list": {
            "brand_preferences": [
                "Brand is one of: Yogi, Wickedly Prime, Wild Bliss, Kehl-Kronenhof, or My Land",
                "Product packaging or listing displays organic certification and clear source/origin statements",
                "Product images or description explicitly show full-leaf or visible plant parts rather than powdered or dust"
            ],
            "price_sensitivity": [
                "Total product price is within the $10–$15 budget range",
                "Price per usable serving (per bag or per ounce) is presented and comparable to past purchases in the $8–$30 range"
            ],
            "rating_sensitivity": [
                "At least three customer reviews specifically reference ingredient authenticity, organic/non‑GMO claims, or visible plant parts",
                "A number of reviews report tasting or perceptible effects (flavor intensity or respiratory/soothing outcome) rather than only packaging or delivery comments"
            ],
            "functional_requirements": [
                "Product label or description explicitly states 'caffeine-free' or 'low‑caffeine'",
                "Complete ingredient list is provided and contains no filler ingredients (e.g., undefined additives or generic 'natural flavors')",
                "Available format is tea bags or sachets designed to preserve full‑leaf quality (e.g., pyramid/triangle bags, whole‑leaf sachets, or loose‑leaf option)",
                "Steeping instructions and recommended serving/concentration are provided on the label or product page",
                "Unit count equals 25–64 tea bags or an equivalent loose‑leaf quantity listed on the product page"
            ],
            "aesthetic_preferences": [
                "Primary packaging is a tin, clear pouch, or similarly premium material that reveals leaf pieces or flower parts",
                "Individual tea bags (if included) are individually wrapped with no visible staples",
                "Labeling uses simple, informative text and subdued/earthy color palette rather than flashy graphics"
            ],
            "purchase_preferences": [
                "Packaging is described as freshness‑preserving (individually sealed pouches or airtight tin) on the product page",
                "Product description includes origin details, certifications, and brewing instructions",
                "Seller offers a stated satisfaction guarantee or a clear return/replacement policy on the product page",
                "Multi‑pack or multi‑box purchase option is available for convenience",
                "Shipping information indicates protective packaging or notes that tins/packaging will be protected during shipment"
            ]
        }
    },
    {
        "user": "AHPY6AUXGS3GHQZKSGXVYAKI6GUQ",
        "seed_product_type": "Cupcake Toppers",
        "situation": "Looking for fun cupcake toppers to decorate a kid’s dinosaur-themed birthday party.",
        "budget_range": "around $10–$14 for a 24-pack",
        "query_type": "attribute_specific",
        "user_query": "looking for starburst chewy candy with all pink strawberry flavor in a big pack",
        "user_context": {
            "brand_preferences": "The user appears brand-agnostic and willing to buy from many small or niche sellers rather than showing strong loyalty to a single brand. Their purchases span Citadel Black, GEORLD, YCTHUNFISH, OWAREY, Arthsdite, ecoZen Lifestyle, Sugar Robot Inc., TOPTAMP and others, indicating openness to trying different makers of party supplies. When choosing between brands they favor ones that explicitly state safety/food-grade materials, clear use instructions, or strong seller assurances (refund guarantees, fast response), so brand affinity is driven by clear product claims and trust signals rather than long-term loyalty to a single name.",
            "price_sensitivity": "The user demonstrates medium price sensitivity: they regularly buy low-cost party supplies in the roughly $6–$14 range and accept inexpensive options, but will pay toward the higher end (around $10–$14) for perceived quality (edible wafer paper, double-sided prints, glitter finishes) or larger pack sizes. They do not appear to seek only the absolute cheapest option; instead they balance price against unit count and features (pre-assembled, edible vs. non-edible).",
            "rating_sensitivity": "The user shows moderate review sensitivity: most purchased items have strong average ratings (generally 4.5+ stars), suggesting they prefer well-rated listings, but their own reviews are brief and uniformly positive, implying they are not strictly constrained to only top-ranked products. In short, ratings and review counts are a meaningful input among other factors (price, materials, safety claims), rather than the sole decision driver.",
            "functional_requirements": "For cupcake/cake toppers the user consistently requires: food-safe and non-toxic materials (edible wafer paper or food-grade sticks), pack quantities suitable for parties (commonly 24–48 pieces), sizes that fit standard cupcakes (roughly 1.5–3 inches wide), ready-to-use or pre-assembled components to save setup time, durable construction (thick cardstock or sturdy wafer paper), and clear usage/storage guidance (shelf-life/use-within window). They also prefer child-safe designs (rounded or non-sharp picks) when intended for kids and expect items to be usable across common occasions (birthdays, anniversaries, baby showers).",
            "aesthetic_preferences": "The user favors playful, themed and visually striking party designs: whimsical kid-focused motifs (dinosaurs, unicorns, Paw Patrol, butterflies), pastel palettes for children’s sets, and metallic/glitter finishes (rose gold, silver, gold) for more celebratory or adult themes. They like both realistic printed designs and reversible or double-sided prints, vibrant colors that photograph well, and occasional novelty/hipster themes (e.g., whiskey toppers) for grown-up events.",
            "purchase_preferences": "The user values a reliable shopping experience: fast and intact fulfillment (references to Amazon logistics), clear product descriptions and safety warnings, sellers that offer money-back guarantees or easy refunds (90-day or full refund promises), and responsive customer service (seller response within 24 hours). They prefer items that arrive ready-to-use (pre-assembled), in undamaged packaging, and from sellers with dependable shipping and transparent return policies."
        },
        "check_list": {
            "brand_preferences": [
                "Product listing explicitly states materials are food-safe, food-grade, edible, or non-toxic in the product description or specifications.",
                "Product listing includes clear use instructions (how to apply/store/serve) in the product description or an attached instruction sheet.",
                "Seller or listing documents a money-back guarantee or refund policy (e.g., full refund, return window) in the product page or seller terms.",
                "Seller contact or seller response policy is documented on the product page or seller profile (e.g., expected response time stated)."
            ],
            "price_sensitivity": [
                "Total price for the offered pack of cupcake toppers is within $10–$14 for a 24-piece pack or, if pack size differs, the unit price per topper scales to equal or better value compared with $10–$14/24.",
                "If price exceeds $10 per 24-piece equivalent, the listing documents added-value features (edible wafer paper, double-sided prints, metallic/glitter finishes, or larger pack size) that justify the higher price."
            ],
            "rating_sensitivity": [
                "Average customer rating on the product page is 4.5 stars or higher (based on the platform rating scale)."
            ],
            "functional_requirements": [
                "Pack quantity is at least 24 pieces per order or the listing clearly states the exact piece count and packaging multiples to reach 24 pieces.",
                "Individual topper dimensions are documented and fall within roughly 1.5–3.0 inches in width as stated in the product specifications.",
                "Product is sold ready-to-use or pre-assembled as stated in the product description (no additional assembly required beyond minimal insertion into cupcakes).",
                "Materials and construction are described as durable (e.g., thick cardstock, sturdy wafer paper, or reinforced picks) in the product specifications.",
                "Product listing includes clear storage/shelf-life or use-within guidance (e.g., best before, storage conditions, or recommended use window).",
                "Design or picks are described as child-safe (rounded or non-sharp picks) in the item specifications or safety notes."
            ],
            "aesthetic_preferences": [
                "Designs explicitly include dinosaur-themed motifs in images or product title/description.",
                "Color palette in product photos or description is vibrant and photographic (bright colors that show clearly in images) or specified as such in color descriptions.",
                "Listing specifies double-sided or reversible printing, or product photos show designs printed on both sides.",
                "Listing indicates availability of playful/kid-focused styling (whimsical illustrations) rather than strictly adult/novelty themes."
            ],
            "purchase_preferences": [
                "Shipping method and estimated delivery timeframe are stated and align with fast fulfillment (e.g., estimated delivery within the platform's typical fast-shipping window).",
                "Return and refund policy is clearly documented on the product page (including timeframe for returns or refunds).",
                "Seller has documented responsiveness (seller contact available) or seller profile shows recent seller activity/contact options.",
                "Product packaging and condition on arrival are described or shown (packaging that protects toppers and indicates they will arrive undamaged), or product images/specs show protective packaging.",
                "Listing explicitly states the product will arrive pre-assembled and ready-to-use in the packaging description or product details."
            ]
        }
    },
    {
        "user": "AEQLRFSCJIRIKSYQ2KQJCIBP4RHQ",
        "seed_product_type": "Gummy Candy",
        "situation": "Looking to buy bulk fruity candy for a party or celebration.",
        "budget_range": "around $10–$20",
        "query_type": "attribute_specific",
        "user_query": "looking for Mitmai soft chewy fruit candies with mango, lychee, and mangosteen flavors",
        "user_context": {
            "brand_preferences": "This shopper repeatedly buys and praises brands that position themselves as low‑sugar, plant‑based or premium gourmet gummy makers. Project 7 and Candy Kittens appear as clear favorites — multiple 5‑star and 4‑star reviews praise their texture, flavors and ingredient claims — while SmartSweets and Life Savers are also accepted when they meet low‑sugar or nostalgic taste expectations. The user is less loyal to brands that trigger safety or packaging concerns (Herbaland was rejected because of a Prop 65 warning) and is willing to buy mainstream names like Starburst but criticizes value when quantity or labeling is lacking. Overall, brand affinity is strongest for companies that deliver authentic fruit flavor, vegan/plant‑based or keto/low‑sugar formulations and a premium presentation.",
            "price_sensitivity": "Medium sensitivity: the user repeatedly notes price and value but will pay a premium for specific benefits (low sugar, keto friendliness, authentic flavor and good texture). Several reviews call products “on the pricey side” yet “worth the money,” and the reviewer cites sale math (example: $22.99 total, $2.87 per pouch) and item prices (e.g., $14.99 Starburst bag) when judging value. They buy bulk/variety packs to maximize value, but will call out items as overpriced relative to quantity or lacking freshness/shelf‑life info.",
            "rating_sensitivity": "Medium sensitivity: the user does not buy solely on star ratings but systematically uses reviews, ingredient lists, nutrition facts and safety notices to decide. They reference calorie/sugar counts, serving sizes, Prop 65 warnings, and manufacturer claims in reviews, and weigh those against personal taste tests (texture, authenticity of flavor). High average ratings help but are only one factor among labels, macros and packaging transparency.",
            "functional_requirements": "For gummy candy the user consistently requires low or reduced sugar (keto/low‑sugar options), clear nutrition and serving information (calories, grams of sugar, net carbs), and plant‑based/gelatin‑free formulations when possible. They expect an authentic fruit flavor profile and a reliable chew/texture with either a satisfying chew or an appropriately tart sour coating. They prefer products without sugar alcohols or artificial sweeteners, with allergen‑friendly claims (gluten‑free, nut‑free, dairy‑free) and clear shelf‑life/freshness dates. Packaging that offers portion control (single‑serve pouches, variety packs) or bulk options is also important.",
            "aesthetic_preferences": "The user favors playful, colorful and premium packaging that emphasizes natural ingredients — multicolored or ‘cute’ candy shapes and bright fruit‑forward graphics appeal to them. They respond positively to gourmet/clean branding (Candy Kittens’ premium look, fruit‑juice claims) and dislike alarming or cluttered labels (Prop 65 warnings). Overall they prefer clean, modern designs that communicate natural flavors, sustainability or health positioning rather than cheap or overly clinical packaging.",
            "purchase_preferences": "This buyer values transparency and reliable shipping for perishable or heat‑sensitive snacks: they note delivery exposure to heat and expect seller notes about temperature and availability during delivery. They prefer individually wrapped or well‑packaged bulk/variety packs for freshness and convenience, appreciate bonus items and clear manufacturer/UPC/origin info, and expect visible freshness dates and ingredient labeling. Good customer service, seller reliability and clear product details (nutrition, warnings, country of origin) matter more than the fastest possible delivery; they will tolerate higher price for trustworthy labeling and packaging that preserves quality."
        },
        "check_list": {
            "brand_preferences": [
                "Product brand is listed as Project 7, Candy Kittens, SmartSweets, or Life Savers",
                "Product listing or packaging explicitly claims plant‑based, vegan, gelatin‑free, or keto/low‑sugar formulation",
                "Product listing does not display a Prop 65 or comparable safety/warning label on the packaging images or product details"
            ],
            "price_sensitivity": [
                "Total price for the offered pack is between $10 and $20",
                "Per‑unit price (price per pouch, per serving, or per ounce) is displayed in the listing for price‑per‑unit comparison",
                "Product is offered in a bulk or variety pack option (multiple pouches or multi‑flavor assortment) within the listed total price"
            ],
            "rating_sensitivity": [
                "Average customer rating is displayed on the product page",
                "Customer reviews include specific mentions of texture (chewiness), authenticity of fruit flavor, or sugar/calorie counts",
                "Customer reviews or Q&A mention ingredient, nutrition, or safety concerns (e.g., Prop 65, artificial sweeteners, sugar alcohols) and those comments are visible"
            ],
            "functional_requirements": [
                "Nutrition facts panel is provided and lists calories, grams of sugar, and serving size",
                "Product declares low or reduced sugar, net carbs, or keto‑friendly nutrition on the label or in product details",
                "Product ingredient list omits gelatin (or lists plant‑based gelling agents) and omits sugar alcohols or artificial sweeteners",
                "Product packaging or listing displays allergen claims (gluten‑free, nut‑free, dairy‑free) and provides shelf‑life or best‑by/freshness date information",
                "Packaging format includes portion control options (individual single‑serve pouches or clearly labeled portioned servings) or larger bulk counts"
            ],
            "aesthetic_preferences": [
                "Packaging images show colorful, fruit‑forward graphics and playful candy shapes or multicolored product presentation",
                "Packaging design presents a clean, modern or premium appearance (minimal clutter, legible ingredient/nutrition typography, premium branding cues)",
                "Packaging or product images do not emphasize alarming or cluttered warning labels that dominate the front‑of‑pack"
            ],
            "purchase_preferences": [
                "Product listing includes seller or manufacturer notes about shipping conditions or temperature sensitivity (heat exposure guidance) for perishable/heat‑sensitive snacks",
                "Product packaging is described or shown as individually wrapped pouches or sealed variety packs to support freshness during multi‑day events",
                "Product detail includes manufacturer information, UPC code, and country of origin in the listing",
                "Seller listing provides visible return policy, seller reliability indicators, or customer service contact details"
            ]
        }
    }
]